In [2]:
# %%
import pandas as pd

df = pd.read_csv('ships.csv')
df

              name        lat        lng
0      Black Pearl  20.664865 -80.709747
1            Cobra  20.664868 -80.709740
2  Flying Dutchman  20.664878 -80.709941
3          Empress        NaN        NaN
4                   20.664875 -80.709777

In [3]:
df[df.isnull().any(axis=1)]

      name  lat  lng
3  Empress  NaN  NaN

In [4]:
df.iloc[-1]['name']

' '

In [5]:
df['name'] = df['name'].str.strip()
df.iloc[-1]['name']

''

In [6]:
df[df.isnull().any(axis=1)]

      name  lat  lng
3  Empress  NaN  NaN

In [7]:
mask = df['name'].str.strip() == ''
mask

0    False
1    False
2    False
3    False
4     True
Name: name, dtype: bool

In [8]:
type(mask)

pandas.core.series.Series

In [9]:
import numpy as np
df.loc[mask, 'name'] = np.nan

In [10]:
df[df.isnull().any(axis=1)]

      name        lat        lng
3  Empress        NaN        NaN
4      NaN  20.664875 -80.709777

In [11]:
# further features tests
df.loc[mask]

  name        lat        lng
4  NaN  20.664875 -80.709777

In [12]:
idx_true = pd.Series([True, False, False, True])
idx_true

0     True
1    False
2    False
3     True
dtype: bool

Additional tests

In [13]:
df.isnull()

    name    lat    lng
0  False  False  False
1  False  False  False
2  False  False  False
3  False   True   True
4   True  False  False

In [15]:
df[df.isnull()]

  name  lat  lng
0  NaN  NaN  NaN
1  NaN  NaN  NaN
2  NaN  NaN  NaN
3  NaN  NaN  NaN
4  NaN  NaN  NaN

In [18]:
df.isnull().any(axis=1)

0    False
1    False
2    False
3     True
4     True
dtype: bool

In [20]:
df[df.isnull().any(axis=1)]

      name        lat        lng
3  Empress        NaN        NaN
4      NaN  20.664875 -80.709777